Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །རི་ཁྲོད་མ་འབྲས་གྲུབ་པར་མཛོད།
en: Fulfill the desires of Śavarī!’ Caṇḍālī:

source: །དགའ་གཙོ་འཇིག་རྟེན་མགྲོན་གཉེར་བ།
en: ‘Invite the world, O lord of pleasure!

source: །སྟོང་པ་ཉིད་ལ་བཞུགས་སམ་ཅི།
en: Why do you remain in the void? I, Caṇḍālī, beseech you.

source: །ཁྱོད་མེད་ཕྱོགས་ནི་མི་འཚལ་བས།
en: Without you I have no direction.’ Ḍombī:

source: །གདོལ་པ་མོ་བདག་ཞུ་བ་བགྱིད།
en: ‘Arise, O magician!

source: །བདག་གིས་ཁྱོད་ཀྱི་ཐུགས་འཚལ་གྱིས།
en: May I know your mind!

source: །མིག་འཕྲུལ་མངའ་བ་ཁྱོད་བཞེངས་ཤིག །གཡུང་མོ་བདག་ཡིད་དྲན་ཉམས་པས།
en: Since I, Ḍombī, am swooning,

source: །སྙིང་རྗེ་རྒྱུན་ཆད་མ་མཛད་ཅིག །ཨཾ་དང་ཧཱཾ་ལས་རྡོ་རྗེ་ཆེ།
en: Do not interrupt your compassion!’

source: །ཁུ་བའི་གཟུགས་ལས་བཞེངས་ནས་ནི།
en: “The great Heruka arises then, in a fluid form, From the syllables aṁ and hūṁ

source: །ཞབས་རྣམས་ས་ལ་རྡེགས་པ་དང་། །ལྷ་དང་ལྷ་མིན་སྡིགས་པར་མཛད། །གྃ་ཅྃ་བྃ་གྷྃ་པྃ་ཤྃ་ལྃ་ཌྃ། །འདི་ཡིས་ས་བོན་དབྱུང་བར་བྱ།
en: Spreading his feet on the ground And threatening the gods and demigods.

source: །བདག་པོ་དགའ་མའི་ས་བོན་ལ།
en: “From the syllables of the lord’s pleasure consort

source: །ཨོྃ་ཧཱུྃ་སྔོན་པོ་འབར་གཙིགས་པས།
en: Hūṁ and aṁ —in a frightful blaze of blue, One should generate the goddesses of the retinue From their seed syllables gaṁ , caṁ , vaṁ , ghaṁ , puṁ , śaṁ , laṁ , and ḍaṁ

source: །མ་མོའི་འཁོར་ལོ་གྲོང་ཉམས་དགར།
en: “In this circle of mothers, the blissful abode,

source: །གཙོ་བོ་འདི་ལྟར་བསྒོམ་པར་བྱ།
en: One should visualize the lord as follows:

source: །ཞལ་བརྒྱད་པ་ལ་ཞབས་བཞི་པ།
en: He has eight faces, four legs,

source: །ཕྱག་ནི་བཅུ་དྲུག་དག་གིས་བརྒྱན།
en: And is adorned with sixteen arms.

source: །བདུད་བཞི་མཉམ་པར་མནན་པ་ཉིད།
en: “Standing astride the four Māras,

source: །འཇིགས་པ་ཡང་ནི་འཇིགས་པ་པོ།
en: And frightening even fear itself,

source: །སྒེག་ཅིང་དཔའ་བོ་མི་སྡུག་པ།
en: He expresses the moods of sensuality, heroism,

source: །རྒོད་ཅིང་དྲག་ཤུལ་འཇིགས་སུ་རུང་།
en: Disgust, fury, mirth, terror,

source: །སྙིང་རྗེ་རྔམ་དང་ཞི་བ་ཡི།
en: “Compassion, wonder, and peace—

source: །གར་དགུའི་རོ་དང་ལྡན་པ་ཉིད།
en: The nine moods of dramaturgy.

source: །མགོ་ཡི་ཕྲེང་བས་དོ་ཤལ་མཛད།
en: Wearing a skull-garland necklace,

source: །ཉི་མར་བཞུགས་ཤིང་རོལ་མོར་བཅས།
en: He stands on a sun disk and performs his wild tāṇḍava dance.

source: །ཁ་དོག་ནག་པོ་འཇིགས་པ་པོ།
en: “Black and frightening,

source: །སྣ་ཚོགས་རྡོ་རྗེ་སྤྱི་བོར་འཛིན།
en: He has a double vajra scepter fastened to the crown of his head.

source: །ཉིད་ཀྱི་ཞལ་ནས་ཧཱུྃ་སྤྲོ་ཞིང་།
en: He emits the syllable hūṁ from his mouth

source: །ཐལ་བས་སྐུ་ལ་བྱུགས་པ་ཉིད།
en: And his body is smeared with ashes.

source: །བདག་མེད་ལྷན་ཅིག་མཉམ་སྦྱོར་ཞིང་།
en: “Joined with Nairātmyā,

source: །དགའ་བ་གཉིས་གཉིས་སྙོམས་འཇུག་པས།
en: He is engaged in pleasurable union. Motionless, he is attaining bliss;

source: །དབའ་རླབས་མེད་པའི་རང་བཞིན་ཅན།
en: Motionless, he dwells in his own nature.

source: །རྩ་བའི་ཞལ་ནི་བཞད་ཅིང་ནག །གཡས་པའི་ཞལ་ནི་ཀུན་ད་མཚུངས།
en: “His main face is black and smiling. His right one is the color of a jasmine blossom.

source: །གཡོན་པ་དམར་ཞིང་ཆེར་འཇིགས་པ།
en: His left face is red and very frightening,

source: །སྟེང་མའི་ཞལ་ནི་རྣམ་པར་གཙིགས།
en: And his top face is terrifying with its bared fangs.

source: །སྤྱན་ནི་ཉི་ཤུ་རྩ་བཞི་ཆེ།
en: “He has twenty-four eyes altogether,

source: །ལྷག་མའི་ཞལ་ནི་བུང་བ་མཚུངས།
en: And his remaining faces are the color of bees.

source: །རྡོ་རྗེ་རལ་གྲི་འཛིན་པ་དང་། །མདའ་དང་དེ་བཞིན་འཁོར་ལོ་ཉིད།
en: In his right hands he holds a vajra scepter, a sword, An arrow, a wheel,

source: །དེ་བཞིན་གཤོར་དང་དབྱིག་པ་དང་། །རྩེ་གསུམ་པ་དང་ལྕགས་ཀྱུ་ཉིད།
en: “A goblet, a staff, A trident, and a goad.

source: །གཡོན་པར་དྲིལ་བུ་པདྨར་བཅས།
en: In his left hands he has a bell and a lotus,

source: །གཞུ་དང་ཁ་ཊྭཱཾ་ག་འཕྱར་ཞིང་།
en: And brandishes a bow and a khaṭvāṅga.

source: །ཐོད་པ་དང་ནི་རིན་ཆེན་ཉིད།
en: “He also holds a skull cup, a jewel,

source: །སྡིགས་མཛུབ་ཞགས་པ་དེ་བཞིན་ནོ།
en: And a noose, and displays a threatening gesture.

source: །སངས་རྒྱས་སྤྲིན་གྱི་འོད་ཟེར་ལྡན།
en: He is surrounded by clouds of buddhas,

source: །དེ་ལྟར་ཆོ་ག་སྣ་ཚོགས་ཀྱིས།
en: “In this way, one should then follow the routine

source: །དཀར་མོ་ལ་སོགས་དེ་ནས་དགོད།
en: Of visualizing Gaurī, and so forth.

source: །དཀར་མོ་ཁ་དོག་དཀར་མོ་སྟེ།
en: “Gaurī is white in color and is engaged

source: །གཞུ་དང་མདའ་ནི་འགེངས་པ་མཆོག །ཐོད་པ་ཁྲག་གིས་བཀང་བ་དང་། །དེ་བཞིན་རྡོ་རྗེ་གྲི་གུག་ཉིད།
en: In the act of drawing a bow and arrow. Her other implements are a skull cup full of blood And a knife with a vajra handle.

source: །ཆོམ་རྐུན་མ་ནི་ཁ་དོག་དམར།
en: “Caurī is red in color,

source: །འཁོར་ལོ་ལྕགས་ཀྱུ་འཛིན་མར་བརྗོད།
en: And is known to hold a wheel, a goad,

source: །ཐོད་པ་དང་ནི་ཅང་ཏེའུ་ཉིད།
en: A skull cup, and a ḍamaru drum.

source: །གསལ་བའི་གཟུགས་ཅན་དགོད་པར་བྱ།
en: One should visualize her as divinely beautiful.

source: །རྨོངས་བྱེད་མ་ནི་སྐུ་མདོག་ནག །དེ་བཞིན་ཐོད་པ་དང་ནི་གཤོར།
en: “Pramohā is black in color. She holds a skull cup, a goblet,

source: །ས་ལ་ཟློག་པ་ཉིད་དང་ནི།
en: A ploughshare for turning up the earth,

source: །གཡས་པ་རྩེ་གསུམ་འཕྱར་བའོ།
en: And in her right hand she brandishes a trident.

source: །རོ་ལངས་མ་ནི་དཀར་སེར་མཚུངས།
en: “Vetalī is light yellow in color,

source: །ཕྱག་དག་ན་ནི་ཆང་དང་ཆུ།
en: With wine and water in two of her hands,

source: །རལ་གྲི་དང་ནི་ཐོད་པ་ཉིད།
en: And a sword and a skull cup in her other hands.

source: །མཛེས་མའི་གཟུགས་ཅན་བསྒོམ་པར་བྱ།
en: One should visualize her with an alluring form.

source: །པུཀྐ་སཱི་ནི་ཁ་དོག་སེར།
en: “Pukkasī is yellow in color. She holds a tendril of the wish-fulfilling tree,

source: །དཔག་བསམ་ཤིང་གི་ལྕུག་མ་དང་། །ཤ་ཡིས་གང་བའི་ཐོད་པ་དང་། །རིན་ཆེན་དང་ནི་མཆོག་སྦྱིན་ཉིད།
en: A skull bowl filled with meat, and a jewel. She displays a boon-granting mudrā.

source: །གདོལ་པ་མོ་ནི་སྔོ་མདོག་མཚུངས།
en: “Caṇḍālī is blue in color

source: །དེ་བཞིན་རླུང་གི་གོས་འཛིན་མ།
en: And holds a wind-cloth.

source: །གཞན་བདག་གིས་ཐོད་པ་དང་། །དེ་བཞིན་པདྨ་དཀར་པོ་ཉིད།
en: In her other two hands she holds

source: །གཡུང་མོ་སྔོ་དང་དཀར་བའི་མདོག །རྡོ་རྗེ་དང་ནི་ལྕགས་ཀྱུ་འཛིན། །གཡོན་པས་ཐོད་པ་འཛིན་པ་སྟེ། །གཞན་པས་རླུང་གི་གོས་འཛིན་མ།
en: A skull cup and a white lotus.

source: །གྷསྨ་རཱི་ནི་ལྗང་སེར་མཚུངས།
en: “Ghasmarī is yellowish green in color.

source: །རྡོ་རྗེ་མེ་ཐབ་དགྲ་སྟའི་ལག །ཐོད་པ་ཚིལ་བུས་ཡོངས་གང་བ།
en: She holds a vajra-fire pit and an axe in two of her hands, Has a skull cup filled with fat in her other left hand,

source: །གཡས་པ་མི་འཇིགས་སྦྱིན་བྱེད་མ།
en: And displays a gesture of granting fearlessness with her other right hand.

source: །རི་ཁྲོད་མ་ནི་དཀར་མདོག་མཚུངས།
en: “Śavarī is white in color, With a khaṭvāṅga, a skull cup,

source: །ཁ་ཊྭཱཾ་ག་དང་ཐོད་པའི་ལག །རྡོ་རྗེ་དེ་བཞིན་ཞགས་པ་ཉིད།
en: A vajra scepter, and a noose.

source: །སྣ་ཚོགས་གཟུགས་ཅན་བསྒོམ་པར་བྱ།
en: One should visualize forms in all their diversity. “They each have a creature:

source: །རོ་ཧི་ཏ་དང་ཕག་ཉིད་དང་། །རུས་སྦལ་དེ་བཞིན་ལྟོ་འཕྱེ་ཉིད།
en: Gaurī, a rohita fish; Caurī, a wild boar; Pramohā, a tortoise; Vetalī, a snake;

source: །སེང་གེ་དེ་བཞིན་སྟག་ཉིད་དང་། །ཝ་དང་དགེ་སློང་ཉིད་རྣམས་ནི།
en: Pukkasī, a lion; Caṇḍālī, a tiger; Ghasmarī, a jackal;

source: །དེ་ལྟར་དཀར་མོ་ལ་སོགས་པའི།
en: and Śavarī, a bear.

source: །ཐོད་པ་བརྒྱད་དུ་ཆོ་ག་བཞིན།
en: “They are in the eight skull cups, respectively, Of Gaurī, and so forth, in the right order.

source: །སྒེག་པ་ལ་སོགས་རོ་དང་ལྡན།
en: And express the moods of sensuality, and so forth. “There are also the following goddesses:

source: །རྟ་ཡི་གཟུགས་དང་ཕག་གི་གདོང་། །ཁྱི་གདོང་དེ་བཞིན་སེང་གེ་མ།
en: The horse-faced, the pig-faced, the dog-faced, and the lion-faced.

source: །ཞལ་བཞི་མ་ལ་ཕྱག་བཞི་མ།
en: All have four arms and four faces,

source: །སྦྲུལ་གྱི་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན།
en: And are adorned with serpent jewelry. “Also present are Vaṃśā, the flute goddess, Vīṇā, the lute goddess,

source: །གླིང་བུ་དང་ནི་པི་ཝང་དང་། །མུ་ཀུནྡ་དང་རྫ་རྔ་སྟེ།
en: Mukundā, the kettle-drum goddess, and Murajā, the tambourine goddess.

source: །ཕྱག་གཉིས་མ་ལ་ཞལ་གཅིག་མ།
en: They each have two arms, one face,

source: །ནག་མོ་དཀར་སེར་ལྟ་བུ་དང་། །དེ་བཞིན་སྟེང་དུ་རྟ་གདོང་ལྗང་།
en: Are, respectively, black, white, and yellow, with the upper face being green. Those of the pig-faced goddess are—in the same order—

source: །སེར་མོ་ནག་མོ་དཀར་མཚུངས་དང་། །དེ་བཞིན་སྟེང་དུ་ཕག་གདོང་དམར།
en: Yellow, black, and white, with the upper face being red. “The faces of the dog-faced goddess

source: །དམར་ཞིང་ནག་དང་དཀར་མཚུངས་ཤིང་། །དེ་བཞིན་སྟེང་དུ་ཁྱི་གདོང་སར།
en: Are red, black, and white, with the upper face being yellow. Those of the lion-faced goddess

source: །ལྗང་དང་ནག་དང་དཀར་བའི་གདོང་། །སྟེང་དུ་འབར་བའི་སེང་གེ་གདོང་།
en: Are green, black, and white, with the upper face being the color of flames.

source: །ཐམས་ཅད་སྐྲ་ནི་སྟེང་དུ་འབར།
en: “Each of the goddesses has blazing, upward-flowing hair

source: །གཡོན་བརྐྱང་བ་ཡིས་རོ་མནན་ཅིང་།
en: And stands astride a corpse, her left leg extended and her right slightly bent.

source: །སྤྱན་གསུམ་ཁྲོ་ཞིང་སྒེག་པ་དང་། །རྒོད་པའི་བཞིན་ནི་བསྒོམ་པར་བྱ།
en: They all have three eyes and are to be visualized With faces expressing the moods of anger, sensuality, and mirth.”

source: །ཧེ་རུ་ཀ་བསྐྱེད་པ་གསུམ་པ་ལས་རབ་ཏུ་བྱེད་པ་དང་པོའོ།། །།ཡེ་ཤེས་མཁའ་འགྲོའི་སྒྲུབ་ཐབས་ནི།
en: This concludes the first part of the third chapter, on generating Heruka.

source: །རྡོ་རྗེ་གཙོ་བོ་རྒྱལ་པོ་ཉོན།
en: “Listen, Vajragarbha, O powerful king,

source: །གཉིས་མེད་ཡེ་ཤེས་ཆོས་ལྡན་པའི།
en: About the practice of Jñānaḍākinī,

source: །གཉིས་ཀྱི་དངོས་པོ་སྤངས་པ་ཡིས།
en: Which is for those who abandon dualistic notions

source: །རྣལ་འབྱོར་ཀུན་སོགས་དང་པོར་ནི།
en: And gain the wisdom of phenomena as nondual. “One should recite the following formula of purification

source: །དག་པ་གསུམ་ནི་གདོན་པར་བྱ། །སྭ་བྷ་བ་ཤུད་དྷཱཿ།
en: At the beginning of every practice three times:

source: སརྦ་དྷརྨཱ་སྭ་བྷ་བ་ཤུད་དྷོ྅་ཧཾ། །བཛྲ་ཤུད་དྷཱཿ།
en: “All phenomena are pure by nature; I am pure by nature.

source: །སརྦ་དྷརྨཱ་བཛྲ་ཤུད་དྷོ྅ཧཾ།
en: All phenomena have the pure nature of vajra;

source: །ཡོ་ག་ཤུད་དྷཱཿ།
en: I have the pure nature of vajra.

source: སརྦ་དྷརྨཱ་ཡོ་ག་ཤུད་དྷོ྅ཧཾ།
en: All phenomena have the pure nature of the union; I have the pure nature of the union.

source: །དེ་ལྟར་བྱས་ནས་རྣལ་འབྱོར་པས།
en: “Having thus recited, the practitioner

source: །ཡང་ནི་བསམ་གཏན་དེ་ཉིད་བྱ།
en: Should meditate on the same. He should then commence the meditation proper

source: །ཡིད་དང་རྗེས་མཐུན་གནས་རྣམས་སུ།
en: In a place pleasing to the mind.

source: །དེ་ནས་བསམ་གཏན་བརྩམ་པར་བྱ། །བླ་རེ་ཡང་ནི་བྲེ་བ་ཉིད།
en: “He should spread out a canopy,

source: །སྣ་ཚོགས་གོས་ནི་འཕྱང་བ་དང་། །འཕན་དང་རྒྱལ་མཚན་བསྒྲེང་བ་དང་། །ཕྱོགས་བཅུའི་གནས་ནི་ཐམས་ཅད་དུ།
en: Hang fabrics of various colors from it, And hoist up streamers and banners. All around, throughout the ten directions,

source: །དྲི་ཞིམ་མེ་ཏོག་སྣ་ཚོགས་དང་། །དེ་བཞིན་དྲི་ཡི་དཀྱིལ་འཁོར་དུ།
en: “He should strew various perfumes and flowers, And then form a maṇḍala of scented powders.

source: །སྐད་ཅིག་གཅིག་པའི་རྣལ་འབྱོར་གྱིས།
en: There, through an instantaneous transformation,

source: །བདག་གི་ལུས་ནི་བསམ་པར་བྱ།
en: He should visualize his own form as the deity. “Thus visualizing himself as Jñānaḍākinī,

source: །བློ་གྲོས་ལྡན་པས་སྔར་མཆོད་ནས། །ཡེ་ཤེས་མཁའ་འགྲོ་མ་ནི་གཟུང་། །དེ་ལྟར་ཆོ་ག་སྣ་ཚོགས་ནི།
en: The wise practitioner should first worship her with offerings.

source: །ངེས་པར་བསྒོམ་པ་ཉིད་དུ་བྱ།
en: He should accordingly generate,

source: །ཡེ་ཤེས་རྒྱ་མཚོ་རི་བོའི་མགོར།
en: According to proper procedure, an ocean of wisdom. “He should then visualize Mount Meru,

source: །ཕྱོགས་སོགས་ཁ་དོག་བཞི་ནི་བསམ།
en: With the four directions surrounding its peak having four different colors.

source: །དེ་བཞིན་གསེར་གྱི་རྒྱན་བྱུང་དང་། །རིན་ཆེན་བདུན་གྱིས་རྣམ་པར་སྤྲས།
en: Atop the peak is a golden palace, Bright and colorful with the seven types of jewels.

source: །གཡེར་ཀ་འབར་བའི་ཕྲེང་བ་ནི།
en: “Around it are garlands of wind chime bells,

source: །འདོད་པས་ཀུན་ཏུ་རྒྱས་པར་ནི།
en: Spread all around as desired. He should also visualize a lion throne

source: །གནས་ནི་ལྔ་རུ་སེང་གེ་ཡི། །གདན་ནི་བསྒོམ་པ་ཉིད་དུ་བྱ།
en: In each of the five places.

source: །ཉི་མའི་དཀྱིལ་འཁོར་བསམས་ནས་ནི།
en: “Then, visualizing a sun disk

source: །གདུགས་ནི་དཀར་པོས་རྣམ་པར་སྤྲས།
en: Adorned with a white parasol,

source: །བདག་གིས་དབུགས་ཀྱིས་ཕྱུང་ནས་ནི།
en: He should, with the exhalation of his breath,

source: །དབུས་སུ་ཡེ་ཤེས་མཁའ་འགྲོ་མ།
en: Project Jñānaḍākinī into its center.

source: །ཞལ་གསུམ་པ་ལ་ཕྱག་དྲུག་ཉིད།
en: “She has three faces and six arms,

source: །སེམས་དཔའི་སྐྱིལ་མོ་ཀྲུང་གིས་གནས།
en: And sits in the sattvaparyaṅka posture.

source: །མ་བཅིངས་སྐྲ་ཡིས་མཛེས་པ་དང་། །སངས་རྒྱས་ལྔ་ཡིས་རྣམ་པར་བརྒྱན།
en: She is adorned with loose, disheveled hair And the five buddhas atop her head.

source: །ཁ་དོག་སྔོན་མོ་འཇིགས་ཆེན་མོ།
en: “Blue in color, and with a terrifying form,

source: །རྒོད་དང་ཁྲོ་བ་སྒེག་པ་དང་། །སྤྱན་གསུམ་གསལ་བའི་གཟུགས་ཅན་མ།
en: Expressing the moods of mirth, anger, and sensuality, She has three eyes, and is divinely beautiful.

source: །སྒྲ་ཆེར་རྒོད་དང་གཙིགས་པ་མོ།
en: “She is laughing loudly, baring her fangs,

source: །གོས་ནི་དམར་པོས་ཤིན་ཏུ་མཛེས།
en: And beautiful in her red apparel.

source: །སྟེང་དུ་ཁ་ཊྭཱཾ་ག་ཉིད་དང་། །གཉིས་པ་ལ་ནི་དགྲ་སྟ་ཉིད།
en: She holds up a khaṭvāṅga, And in her second hand, an axe.

source: །གསུམ་པ་ལ་ནི་རྡོ་རྗེ་ཉིད།
en: “In her third hand she has a vajra scepter.

source: །གཡོན་ན་དེ་བཞིན་དྲིལ་བུའི་སྒྲ།
en: In her first left hand, she has a bell;

source: །གཉིས་པ་ལ་ནི་ལྷུང་བཟེད་ཉིད།
en: In her second left hand, an alms bowl;

source: །གསུམ་པར་དེ་བཞིན་རལ་གྲི་འཛིན།
en: And in her third, she holds a sword.

source: །འོད་ཟེར་འབར་བ་དུ་མ་དང་། །དབུས་སུ་མཁས་པས་བསྒོམ་པར་བྱ།
en: “The wise practitioner should visualize her in the middle, Radiating manifold rays of light.

source: །ཡེ་ཤེས་མཁའ་འགྲོའི་མདུན་དུ་ནི།
en: To the east of Jñānaḍākinī, he should project,

source: །མ་བཅིངས་པ་ཡི་སྐྲ་ཡིས་བརྒྱན།
en: Adorned with loose, disheveled hair,

source: །སྦྲུལ་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །སྒེག་པའི་རོ་དང་ལྡན་པ་དང་། །ཤིན་ཏུ་མཛེས་པའི་གོས་ཀྱིས་བརྒྱན།
en: Bedecked with adornments made of snakes, And expressing the mood of sensuality. “She is bedecked with exquisite garments

source: །ཕྱག་གཉིས་ཀྱིས་ནི་རྣམ་པར་སྤྲས།
en: And adorned with two arms. He should visualize Vajraḍākinī

source: །རྣལ་འབྱོར་ལྷུང་བཟེད་ཁ་ཊྭཱཾ་ག། །རྡོ་རྗེ་མཁའ་འགྲོ་མ་བསྒོམ་བྱ།
en: Carrying a khaṭvāṅga and a yogic alms bowl.

source: །ཡེ་ཤེས་བྱང་གི་ཆ་ལ་ནི།
en: “To the north of Jñānaḍākinī, projected with his outgoing breath,

source: །བདག་གིས་དབུགས་ལས་ཕྱུང་ནས་ནི།
en: He should visualize Ghoraḍākinī,

source: །རྣལ་འབྱོར་ལྷུང་བཟེད་ཁ་ཊྭཱཾ་ག།
en: “She carries a khaṭvāṅga and a yogic alms bowl,

source: །མ་བཅིངས་སྐྲ་ཡིས་རྣམ་པར་བརྒྱན།
en: Is adorned with loose, disheveled hair,

source: །ཡན་ལག་སྦྲུལ་གྱིས་བརྒྱན་དང་ནི།
en: And her limbs are adorned with ornaments made of snakes.

source: །ཤིན་ཏུ་མཛེས་པའི་གོས་ཀྱིས་བརྒྱན།
en: Her figure is bedecked with exquisite garments. “Thus should he visualize

source: །འཇིགས་པའི་མཁའ་འགྲོ་ཞེས་བྱ་བསྒོམ།
en: The goddess called Ghoraḍākinī.

source: །ཡེ་ཤེས་ནུབ་ཀྱི་ཆ་ལ་ནི།
en: “To the west of Jñānaḍākinī He should project Vetalī.

source: །ཡང་ནི་རོ་ལངས་མ་ཕྱུང་ནས། །ཕྱག་གཉིས་སེམས་དཔའི་སྐྱིལ་མོ་ཀྲུང་།
en: Again, she has two arms and sits in the sattvaparyaṅka posture.

source: །ཁ་དོག་སྔོན་མོ་ཤིན་ཏུ་མཛེས།
en: She is blue in color and exquisite. “She holds a khaṭvāṅga and a yogic bowl,

source: །རྣལ་འབྱོར་ལྷུང་བཟེད་ཁ་ཊྭཱཾ་ག །མ་བཅིངས་པ་ཡི་སྐྲ་ཡིས་བརྒྱན།
en: And is adorned with loose, disheveled hair.

source: །ལུས་ལ་སྦྲུལ་གྱིས་བརྒྱན་པ་དང་། །ཤིན་ཏུ་མཛེས་པའི་གོས་ཀྱིས་བརྒྱན།
en: Snakes form her body ornaments, And exquisite clothes embellish her figure.

source: །ཡེ་ཤེས་ལྷོ་ཡི་ཆ་ལ་ནི།
en: “To the south of Jñānaḍākinī

source: །གདོལ་པ་མོ་ནི་དམར་མོ་ལྟར།
en: He should project the red Caṇḍālī,

source: །སྣ་ཚོགས་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན།
en: And is adorned with different ornaments. The practitioner should thus visualize this pentad of goddesses,

source: །ཡོངས་གང་གཟུགས་དང་གཟི་བརྗིད་ལྡན།
en: Himself endowed with perfect beauty and form.

source: །འདི་ནི་རྣལ་འབྱོར་པ་ཡིས་བསྒོམ།
en: “In the northeast he should visualize

source: །དབང་ལྡན་ལྷ་མོ་སེང་གེ་མ། །གདོང་ནི་སེང་གེར་བསམ་པར་བྱ།
en: The goddess Siṃhinī with the face of a lion.

source: །དཀར་དང་སེར་བ་ལྟ་བུར་ནི།
en: She is white and yellow, and stands with her right leg outstretched

source: །ཀླུ་དབང་སྟན་ལ་གཡས་བརྐྱང་གནས།
en: And the left slightly bent, on a pedestal fashioned from the lord of nāgas.

source: །རྡོ་རྗེ་ལྕགས་ཀྱུ་སྡིགས་མཛུབ་ཞགས།
en: “She holds a vajra goad and, in her other hand, a noose in a threatening gesture.

source: །ཤིན་ཏུ་མཛེས་པའི་གོས་ཀྱིས་བརྒྱན། །འོད་ཟེར་འབར་བ་དུ་མས་ནི།
en: She is nicely attired in exquisite garments.

source: །ལུས་ནི་འབར་བར་བསྒོམ་པར་བྱ།
en: He should visualize her body radiating With a manifold blaze of light rays.

source: །མེར་ནི་སྟག་མོ་ཞེས་བྱ་བ།
en: “In the southeast there is the goddess called Vyāghrī

source: །རིན་ཆེན་བདུན་པོ་མཆོག་གི་གདན།
en: On a supreme throne made of seven types of jewels.

source: །ཕྱག་གཉིས་སྔོ་དང་དཀར་བ་མཚུངས།
en: She has two arms, is blue and white in color,

source: །གོས་དང་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །འབར་བའི་རྡོ་རྗེ་ལྕགས་ཀྱུ་དང་། །དེ་བཞིན་སྡིགས་མཛུབ་ཞགས་པ་ཉིད།
en: And is beautifully attired and adorned with jewelry. “She holds a blazing vajra goad and a noose, While forming a threatening gesture with her fingers. He should visualize her body radiant

source: །འོད་ཟེར་འབར་བ་དུ་མས་ནི། །ལུས་ནི་འབར་བར་བསྒོམ་པར་བྱ།
en: With a manifold blaze of light rays.

source: །བདེན་བྲལ་ལྷ་མོ་ཝ་གདོང་མ།
en: “In the southwest there is the goddess Jambukī,

source: །སྒྲ་ཆེར་རྒོད་དང་འཇིགས་པ་མོ།
en: Laughing loudly and inspiring fear.

source: །མ་ཧེའི་གདན་དང་ཡང་དག་ལྡན།
en: She is mounted on a buffalo.

source: །དམར་ཞིང་ནག་པའི་ཁ་དོག་མ།
en: Her body is red and black in color.

source: །ལུས་ལ་ཤིན་ཏུ་མཛེས་གོས་དང་། །ཕྱག་གཉིས་ཀྱིས་ནི་རྣམ་པར་སྤྲས།
en: “Her body is attired with exquisite garments And she has two arms.

source: །ལྕགས་ཀྱུ་ཞགས་པ་སྡིགས་མཛུབ་མ།
en: Her implements are a noose held with a threatening gesture and a goad.

source: །སྦྲུལ་གྱི་རྒྱན་གྱིས་བརྒྱན་པའོ།
en: She is adorned with ornaments made of snakes.

source: །རླུང་དུ་ལྷ་མོ་འུག་པ་མ།
en: “In the northwest there is the goddess Ulūkā,

source: །སེར་དང་དམར་བའི་ཁ་དོག་མ།
en: Yellow and red in color.

source: །ཀླུ་ཡི་གདན་ལ་གནས་པ་དང་། །དེ་ཉིད་རྒྱན་ནི་རབ་ཏུ་བརྟག །ཕྱག་གཉིས་སེམས་དཔའི་སྐྱིལ་ཀྲུང་གནས།
en: She sits on a snake throne And snakes, too, should be visualized as her ornaments. “She has two arms and sits in the sattvaparyaṅka posture.

source: །འོད་ཟེར་འབར་བ་དུ་མ་ཡིས། །ཐམས་ཅད་ཀྱི་ནི་ཐམས་ཅད་འབར།
en: With a manifold blaze of light rays.

source: །མཁའ་འགྲོ་མ་བརྒྱད་དབུས་སུ་སྟེ།
en: “There are eight ḍākinīs in the center

source: །ཕྱི་རོལ་དུ་ནི་བཞི་པོ་རྣམས།
en: And four on the outside.

source: །དེ་ལྟར་དགོད་པའི་རིམ་བལྟས་ནས།
en: Having visualized in this way the order of their distribution, He should subsequently assign each one a place.

source: །ཕྱི་ནས་གནས་ནི་རབ་ཏུ་བརྟག །ཤར་དུ་མཁའ་འགྲོ་རྒྱལ་དབང་མོ།
en: “The royal goddess in the east, Ḍākinī

source: །ཕྱག་གཉིས་དང་ནི་མདོག་དཀར་མོ།
en: Has two arms and is white in color.

source: །ཡི་དགས་གདན་ལ་གནས་པ་དང་། །སྦྲུལ་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །སྐྲ་ནི་གྲོལ་ཞིང་དྲག་མོ་དང་། །མེ་ནི་འབར་བའི་འོད་ལྟ་བུ།
en: She sits on a corpse And is adorned with snakes as ornaments. “She is wild, with disheveled hair, And her splendor is like that of a blazing fire.

source: །ཁར་ནི་ལག་པ་བཅུག་ནས་ནི།
en: Radiant, she raises her hands

source: །སྒྲ་ཆེར་རྒོད་དང་དེ་བཞིན་འབར།
en: To her mouth, laughing loudly.

source: །བྱང་དུ་མར་མེ་རྒྱལ་མོ་དབང་།
en: “In the north there is the royal goddess Dīpinī,

source: །ཁ་དོག་གསེར་མདོག་དྲག་ཤུལ་མ།
en: Wild, and yellow in color.

source: །འཇིགས་པའི་གཟུགས་ཅན་གཙིགས་པ་ཅན།
en: Frightening in form and baring her teeth,

source: །རབ་ཏུ་སོང་བའི་སྟན་ལ་གནས།
en: “She sits on a corpse;

source: །འབར་བའི་མེ་ནི་ལྟ་བུའི་འོད།
en: Her splendor is like that of a blazing fire.

source: །ཐལ་མོ་གཉིས་ཀྱིས་ལག་པ་ནི།
en: Her two hands are folded together at her forehead,

source: །མགོ་བོའི་སྟེང་དུ་མར་མེ་བཞིན།
en: Resembling the flame of a lamp.

source: །ནུབ་ཏུ་ལྷ་མོ་འཇིབ་བྱེད་མ།
en: “In the west there is the goddess Cūṣiṇī,

source: །ཁ་དོག་དམར་མོ་འཇིགས་པ་མོ།
en: Red in color and inspiring fear.

source: །ཁྲག་གི་སྲད་བུ་ལག་པ་ཡི།
en: “From her cupped hands she drinks blood,

source: །སྙིམ་པར་ཁྲག་ནི་འཐུང་བར་བྱེད།
en: Trickling in the form of a red thread.

source: །མེ་ནི་འབར་བའི་འོད་དྲག་མོ།
en: Fierce and with the splendor of a blazing fire,

source: །ལྷ་མོ་གཙོ་མོ་འཇིབ་བྱེད་མ།
en: Cūṣiṇī is indeed a powerful deity.

source: །ལྷོ་རུ་གཡོ་ལྡན་མ་ཞེས་པ།
en: “In the south there is the goddess called Kambojī,

source: །ཁ་དོག་ནག་པོའི་འོད་ལྟ་བུ།
en: Shiny black in color.

source: །གོས་ནི་དམར་པོ་ཤིན་ཏུ་མཛེས།
en: “She looks resplendent in her red clothes

source: །སྦྲུལ་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །སྡིགས་མཛུབ་དང་ནི་གཏུན་ཤིང་ལག །ཐམས་ཅད་སེམས་ནི་རྨོངས་པར་བྱེད།
en: And is adorned with ornaments of snakes. In her hands she holds a javelin and displays a threatening gesture. She makes everyone’s mind free from delusion. “The all-knowing practitioner should always visualize

source: །འབར་བའི་མེ་ཡི་འོད་དྲག་མོ། །ཐམས་ཅད་རིག་པས་ཐམས་ཅད་བསྒོམ།
en: Each of them as wild and radiating like a blazing fire.

source: །འདི་རྣམས་གཟུགས་སོགས་མདུན་དུ་ནི།
en: In front of these forms and images,

source: །དམ་ཚིག་དེ་བཞིན་བསྟན་པར་བྱ།
en: The pledge substances should be displayed accordingly.

source: །རླུང་དང་མེ་ཡིས་བདུན་པའི་དོན།
en: “Taking the seventh syllable from the syllable of wind and the seventh from fire,

source: །རྡོ་རྗེའི་ས་བོན་གྱིས་ནི་བསྐུལ།
en: He should impel the latter seventh with the seed syllable of Vajrī.

source: །ཐིག་ལེ་སྒྲས་ནི་མནན་པས་ནི།
en: This should be crowned by the anunāsika and supported by the sound ū

source: །རྒྱུན་གྱི་ཆར་ནི་ཞེས་བྱར་གསུངས།
en: This combination is known as the torrent of ambrosia.”

source: །གསུམ་པ་ལས་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the third chapter.

source: །།དེ་ནས་བདག་མེད་སྒྲུབ་པ་ནི།
en: “Now I will teach the practice of Nairātmyā,

source: །ཅི་གསུངས་མདོ་རུ་བསྡུས་ནས་བཤད།
en: Briefly, as has been taught.

source: །ནམ་མཁའི་ཁམས་ཀྱི་དབུས་སོན་པར།
en: In the middle of space

source: །ཉི་མའི་དཀྱིལ་འཁོར་བསམ་པར་བྱ།
en: One should visualize a sun disk,

source: །འཁོར་ལོ་སྔོན་དུ་ཅི་རིགས་པར།
en: “Then the maṇḍala with its arrangement of elements

source: །ལྷ་རྣམས་ཇི་ལྟར་འབྱུང་བ་ཉིད།
en: In the order of the appearance of the deities.

source: །འཁོར་ལོ་ས་དང་ཆུ་ནི་སྔོན།
en: Before the maṇḍala comes earth and water, And then fire, in their due order.

source: །གོ་རིམས་བཞིན་དུ་བྱིན་ཟ་དང་། །ལྷ་རྣམས་ཀྱི་ནི་རླུང་ཆེན་དང་། །ཇི་ལྟར་སྒོམ་པ་པོ་འབྱུང་བའི།
en: “Then comes the great wind, and the symbols, Which correspond to the order of the appearance of the deities.

source: །ཆོས་འབྱུང་ལས་སྐྱེས་འཁོར་ལོ་ནི།
en: The maṇḍala, which arises out of the dharmodaya,

source: །འཕར་མ་གཉིས་དག་སྐྱོན་མེད་པ།
en: Has two pure and perfect overlapping areas:

source: །ཟེ་འབྲུ་ལས་ནི་གཅིག་ཡིན་ཏེ།
en: “One is formed by the circle of lotus filaments,

source: །རྡོ་རྗེ་ཅན་གྱི་སྐུ་གསུམ་མཆོག །བཅྭ་ལྔའི་གདན་དང་ལྡན་པ་ཡིས།
en: And the other is the supreme three bodies of the vajra holder.

source: །རོ་ནི་ངེས་པར་བསམ་པར་བྱ།
en: One should visualize a corpse there, Which is the seat for each of the fifteen goddesses.

source: །དེ་ཡི་སྟེང་དུ་ཟླ་བ་ཡིན།
en: “Above it there is a moon disk,

source: །ཟླ་བའི་སྟེང་དུ་ས་བོན་ཉིད།
en: And above the moon disk is the seed syllable;

source: །ཕྱི་ནས་བདུད་ལས་རྒྱལ་བས་མནན།
en: Resting upon that is a sun disk.

source: །གཉིས་འདུས་པ་ལས་བདེ་ཆེན་པོ།
en: From the meeting of these two disks comes great bliss.

source: །ཨཱ་ལི་ཟླ་བའི་གཟུགས་ཀྱིས་གནས།
en: “The moon is then transformed into the vowels

source: །ཀཱ་ལིའི་གཟུགས་ཀྱིས་སྣང་བྱེད་དོ།
en: And the sun into the consonants.

source: །ཟླ་བ་ཉི་མ་གཉིས་འདུས་པས།
en: The meeting of the sun and the moon
